Revit 2027 API
IFCExtrusionData.AddLoop Method
 Adds a curve loop to the extrusion data.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddLoop(
	CurveLoop pLoop
)
Public Sub AddLoop (
	pLoop As CurveLoop
)
public:
void AddLoop(
	CurveLoop^ pLoop
)
member AddLoop :
        pLoop : CurveLoop -> unit
Parameters
pLoop CurveLoop
 The curve loop.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCExtrusionData Class
Autodesk.Revit.DB.IFC Namespace